Repository: KDE/kscreenlocker
Catalog: po/*/kscreenlocker_greet.po
Languages: lv

source: Warning: Caps Lock on
lv: Uzmanību: ir ieslēgts burtslēga taustiņš

source: The session is locked
lv: Sesija ir bloķēta

source: The session has been locked by %1
lv: Sesiju ir bloķējis %1

source: (or place your fingerprint on the reader)
lv: (vai novietojiet pirkstgalu uz pirkstu nospieduma lasītāja)

source: (or use your smartcard)
lv: (vai izmantojiet viedkarti)

source: &Switch Users
lv: &Pārslēgt lietotājus

source: Un&lock
lv: At&bloķēt

source: Unlocking failed
lv: Atbloķēšana neizdevās

source: Greeter for the KDE Plasma Workspaces Screen locker
lv: KDE „Plasma“ darbvirsmas ekrāna bloķētāja sveicinātājs

source: Starts the greeter in testing mode
lv: Palaiž sveicinātāju testēšanas režīmā

source: Starts the greeter with the selected shell theme (only in Testing mode)
lv: Palaiž sveicinātāju ar izvēlēto čaulas motīvu (tikai testēšanas režīmā)

source: Lock immediately, ignoring any grace time etc.
lv: Bloķēt nekavējoties. Ignorēt jebkādu gaidīšanas laiku u.tml.

source: Delay till the lock user interface gets shown in milliseconds.
lv: Noildze bloķēšanas saskarnes parādīšanai (milisekundēs).

source: Don't show any lock user interface.
lv: Nerādīt bloķēšanas saskarni

source: Default to the switch user UI.
lv: Pēc noklusējuma rādīt lietotāju pārslēgšanas saskarni

source: File descriptor for connecting to ksld.
lv: „klsd“ savienojuma datnes deskriptors.
