Repository: KDE/kscreenlocker
Catalog: po/*/kscreenlocker.po
Languages: es, he

# NAME OF TRANSLATORS
source: Your names
es: Eloy Cuadra
he: צוות התרגום של KDE ישראל

# EMAIL OF TRANSLATORS
source: Your emails
es: ecuadra@eloihr.net
he: kde-l10n-he@kde.org

source: The screen locker is broken and unlocking is not possible anymore. In order to unlock it either ConsoleKit or LoginD is needed, neither of which could be found on your system.
es: El bloqueador de pantalla está dañado y ya no se puede desbloquear. Para desbloquear son necesarios ConsoleKit o LoginD, pero ninguno de ellos se encuentra en su sistema.
he: נועל המסך פגום ולא ניתן לנעול עוד. כדי לנעול אותו צריך או את ConsoleKit או את LoginD, אף אחד מהם לא נמצא מותקן במערכת שלך.

source: The screen locker is broken and unlocking is not possible anymore. In order to unlock switch to a virtual terminal (e.g. Ctrl+Alt+F%1), log in as root and execute the command: # ck-unlock-session <session-name>
es: El bloqueador de pantalla está dañado y ya no se puede desbloquear. Para desbloquear, cambie a un terminal virtual (por ejemplo, Ctrl+Alt+F%1), inicie sesión allí como root y ejecute la orden: # ck-unlock-session <nombre-de-la-sesión>

source: The screen locker is broken and unlocking is not possible anymore. In order to unlock switch to a virtual terminal (e.g. Ctrl+Alt+F%1), log in and execute the command: loginctl unlock-session %2 Then log out of the virtual session by pressing Ctrl+D, and switch back to the running session (Ctrl+Alt+F%3).
es: El bloqueador de pantalla está dañado y ya no se puede desbloquear. Para desbloquear, cambie a un terminal virtual (por ejemplo, Ctrl+Alt+F%1), inicie sesión allí y ejecute la orden: loginctl unlock-session %2 Después cierre la sesión del terminal virtual pulsando Ctrl+D y vuelva a cambiar a la sesión que estaba usando (Ctrl+Alt+F%3).

source: Lock Session
es: Bloquear la sesión
he: נעילת הפעלה

source: Screen locked
es: Pantalla bloqueada
he: המסך נעול

source: Screen unlocked
es: Pantalla desbloqueada
he: המסך נפתח

source: Screen Locker
es: Bloqueador de pantalla
he: נועל מסך

source: Ensuring that the screen gets locked before going to sleep
es: Asegurando que la pantalla se bloquea antes de dormir
he: אימות שהמסך ננעל לפני כניסה לשינה

source: The screen locker is broken and unlocking is not possible anymore. In order to unlock it, switch to a virtual terminal (e.g. Ctrl+Alt+F%1), log in as root and execute the command: # ck-unlock-session <session-name>
he: נועל המסך פגום ולא ניתן לנעול עוד. כדי לנעול אותו יש לעבור למסוף וירטואלי (למשל עם Ctrl+Alt+F%1), להיכנס כמשתמש על (root) ולהריץ את הפקודה: ‎# ck-unlock-session <session-name>

source: The screen locker is broken and unlocking is not possible anymore. In order to unlock it, switch to a virtual terminal (e.g. Ctrl+Alt+F%1), log in to your account and execute the command: loginctl unlock-session %2 Then log out of the virtual session by pressing Ctrl+D, and switch back to the running session (Ctrl+Alt+F%3). Should you have forgotten the instructions, you can get back to this screen by pressing CTRL+ALT+F%2
he: נועל המסך פגום ולא ניתן לשחרר עוד. כדי לשחרר אותו יש לעבור למסוף וירטואלי (למשל עם Ctrl+Alt+F%1), להיכנס לחשבון שלך ולהריץ את הפקודה: loginctl unlock-session %2 לאחר מכן לצאת מההפעלה הווירטואלית על ידי לחיצה על Ctrl+D, ולעבור בחזרה להפעלה הפעילה (Ctrl+Alt+F%3). במקרה ששכחת את ההנחיות תוך כדי ביצוע, אפשר לחזור למסך הזה בלחיצה על CTRL+ALT+F%2
